04_OpenFoam/_ref/OpenFOAM-14/incompressibleVoF/waterChannel/system/extrudeMeshDict.1
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  14
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    location    "system";
    object      extrudeMeshDict.1;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

constructFrom mesh;
sourceCase "$FOAM_CASE";
sourcePatches (outlet);

flipNormals false;

extrudeModel
{
    type            linearDirection;

    nLayers         60;
    expansionRatio  1.0;

    axisPt          (0 0 0);
    direction       (1 0.2 0.02);
    thickness       60;
}

mergeFaces false;

// ************************************************************************* //
